IRP/src/Catalogs/SerialLotNumbers/SerialLotNumbers.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
 <name>SerialLotNumbers</name>
 <attributes>
  <name>SerialLotNumberOwner</name>
  <type>
   <types>CatalogRef.Items</types>
   <types>CatalogRef.ItemKeys</types>
   <types>CatalogRef.ItemTypes</types>
  </type>
 </attributes>
 <attributes>
  <name>Inactive</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
 <attributes>
  <name>StockBalanceDetail</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
 <attributes>
  <name>EachSerialLotNumberIsUnique</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
 <attributes>
  <name>BatchBalanceDetail</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
 <attributes>
  <name>CodeString</name>
  <type>
   <types>String</types>
   <stringQualifiers>
    <length>1024</length>
   </stringQualifiers>
  </type>
 </attributes>
 <attributes>
  <name>HasRelatedSerialLotNumbers</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
 <attributes>
  <name>SourceOfOrigin</name>
  <type>
   <types>CatalogRef.SourceOfOrigins</types>
  </type>
 </attributes>
 <tabularSections>
  <name>AddAttributes</name>
  <attributes>
   <name>Property</name>
   <type>
    <types>ChartOfCharacteristicTypesRef.AddAttributeAndProperty</types>
   </type>
  </attributes>
  <attributes>
   <name>Value</name>
   <type>
    <types>Characteristic.AddAttributeAndProperty</types>
   </type>
  </attributes>
  <attributes>
   <name>SearchLiteral</name>
   <type>
    <types>String</types>
    <stringQualifiers>
     <length>500</length>
    </stringQualifiers>
   </type>
  </attributes>
 </tabularSections>
 <tabularSections>
  <name>ConsignorsInfo</name>
  <attributes>
   <name>Company</name>
   <type>
    <types>CatalogRef.Companies</types>
   </type>
  </attributes>
  <attributes>
   <name>Consignor</name>
   <type>
    <types>CatalogRef.Companies</types>
   </type>
  </attributes>
 </tabularSections>
 <tabularSections>
  <name>RelatedSerialLotNumbers</name>
  <attributes>
   <name>SerialLotNumber</name>
   <type>
    <types>CatalogRef.SerialLotNumbers</types>
   </type>
  </attributes>
 </tabularSections>
</mdclass:Catalog>

IRP/src/Catalogs/ItemTypes/ItemTypes.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
 <name>ItemTypes</name>
 <hierarchical>true</hierarchical>
 <attributes>
  <name>Type</name>
  <type>
   <types>EnumRef.ItemTypes</types>
  </type>
 </attributes>
 <attributes>
  <name>UseSerialLotNumber</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
 <attributes>
  <name>DELETE_StockBalanceDetail</name>
  <type>
   <types>EnumRef.DELETE_StockBalanceDetail</types>
  </type>
 </attributes>
 <attributes>
  <name>EachSerialLotNumberIsUnique</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
 <attributes>
  <name>AlwaysAddNewRowAfterScan</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
 <attributes>
  <name>SingleRow</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
 <attributes>
  <name>NotUseLineGrouping</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
 <attributes>
  <name>ItemDescriptionTemplate</name>
  <type>
   <types>String</types>
   <stringQualifiers>
    <length>1024</length>
   </stringQualifiers>
  </type>
 </attributes>
 <attributes>
  <name>ItemLocalFullDescriptionTemplate</name>
  <type>
   <types>String</types>
   <stringQualifiers>
    <length>1024</length>
   </stringQualifiers>
  </type>
 </attributes>
 <attributes>
  <name>ItemForeignFullDescriptionTemplate</name>
  <type>
   <types>String</types>
   <stringQualifiers>
    <length>1024</length>
   </stringQualifiers>
  </type>
 </attributes>
 <attributes>
  <name>ItemKeyDescriptionTemplate</name>
  <type>
   <types>String</types>
  </type>
 </attributes>
 <attributes>
  <name>ItemKeyLocalFullDescriptionTemplate</name>
  <type>
   <types>String</types>
   <stringQualifiers>
    <length>1024</length>
   </stringQualifiers>
  </type>
 </attributes>
 <attributes>
  <name>ItemKeyForeignFullDescriptionTemplate</name>
  <type>
   <types>String</types>
   <stringQualifiers>
    <length>1024</length>
   </stringQualifiers>
  </type>
 </attributes>
 <attributes>
  <name>StockBalanceDetailSerialLotNumber</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
 <attributes>
  <name>BatchBalanceDetailSerialLotNumber</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
 <attributes>
  <name>StockBalanceDetailSourceOfOrigins</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
 <attributes>
  <name>BatchBalanceDetailSourceOfOrigins</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
 <tabularSections>
  <name>AvailableAttributes</name>
  <attributes>
   <name>Attribute</name>
   <type>
    <types>ChartOfCharacteristicTypesRef.AddAttributeAndProperty</types>
   </type>
  </attributes>
  <attributes>
   <name>AffectPricing</name>
   <type>
    <types>Boolean</types>
   </type>
  </attributes>
  <attributes>
   <name>Required</name>
   <type>
    <types>Boolean</types>
   </type>
  </attributes>
  <attributes>
   <name>ShowInHTML</name>
   <type>
    <types>Boolean</types>
   </type>
  </attributes>
  <attributes>
   <name>Collection</name>
   <type>
    <types>Boolean</types>
   </type>
  </attributes>
 </tabularSections>
 <tabularSections>
  <name>AddAttributes</name>
  <attributes>
   <name>Property</name>
   <type>
    <types>ChartOfCharacteristicTypesRef.AddAttributeAndProperty</types>
   </type>
  </attributes>
  <attributes>
   <name>Value</name>
   <type>
    <types>Characteristic.AddAttributeAndProperty</types>
   </type>
  </attributes>
 </tabularSections>
 <tabularSections>
  <name>RegExpSerialLotNumbersRules</name>
  <attributes>
   <name>RegExp</name>
   <type>
    <types>String</types>
    <stringQualifiers>
     <length>250</length>
    </stringQualifiers>
   </type>
  </attributes>
  <attributes>
   <name>Example</name>
   <type>
    <types>String</types>
    <stringQualifiers>
     <length>250</length>
    </stringQualifiers>
   </type>
  </attributes>
 </tabularSections>
</mdclass:Catalog>

IRP/src/Catalogs/Items/Items.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
 <name>Items</name>
 <hierarchical>true</hierarchical>
 <attributes>
  <name>ItemType</name>
  <type>
   <types>CatalogRef.ItemTypes</types>
  </type>
 </attributes>
 <attributes>
  <name>Unit</name>
  <type>
   <types>CatalogRef.Units</types>
  </type>
 </attributes>
 <attributes>
  <name>MainPricture</name>
  <comment>Temporary</comment>
  <type>
   <types>ValueStorage</types>
  </type>
 </attributes>
 <attributes>
  <name>Vendor</name>
  <type>
   <types>CatalogRef.Partners</types>
  </type>
 </attributes>
 <attributes>
  <name>ItemID</name>
  <type>
   <types>String</types>
   <stringQualifiers>
    <length>100</length>
   </stringQualifiers>
  </type>
 </attributes>
 <attributes>
  <name>PackageUnit</name>
  <type>
   <types>CatalogRef.Units</types>
  </type>
 </attributes>
 <attributes>
  <name>ControlCodeString</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
 <attributes>
  <name>CheckCodeString</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
 <attributes>
  <name>ControlCodeStringType</name>
  <type>
   <types>EnumRef.ControlCodeStringType</types>
  </type>
 </attributes>
 <tabularSections>
  <name>AddAttributes</name>
  <attributes>
   <name>Property</name>
   <type>
    <types>ChartOfCharacteristicTypesRef.AddAttributeAndProperty</types>
   </type>
  </attributes>
  <attributes>
   <name>Value</name>
   <type>
    <types>Characteristic.AddAttributeAndProperty</types>
   </type>
  </attributes>
 </tabularSections>
 <tabularSections>
  <name>ConsignorsInfo</name>
  <attributes>
   <name>Company</name>
   <type>
    <types>CatalogRef.Companies</types>
   </type>
  </attributes>
  <attributes>
   <name>Consignor</name>
   <type>
    <types>CatalogRef.Companies</types>
   </type>
  </attributes>
 </tabularSections>
</mdclass:Catalog>

IRP/src/Catalogs/ItemKeys/ItemKeys.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
 <name>ItemKeys</name>
 <attributes>
  <name>Item</name>
  <type>
   <types>CatalogRef.Items</types>
  </type>
 </attributes>
 <attributes>
  <name>Unit</name>
  <type>
   <types>CatalogRef.Units</types>
  </type>
 </attributes>
 <attributes>
  <name>Specification</name>
  <type>
   <types>CatalogRef.Specifications</types>
  </type>
 </attributes>
 <attributes>
  <name>AffectPricingMD5</name>
  <type>
   <types>String</types>
   <stringQualifiers>
    <length>50</length>
   </stringQualifiers>
  </type>
 </attributes>
 <attributes>
  <name>UniqueMD5</name>
  <type>
   <types>String</types>
   <stringQualifiers>
    <length>50</length>
   </stringQualifiers>
  </type>
 </attributes>
 <attributes>
  <name>ItemKeyID</name>
  <type>
   <types>String</types>
   <stringQualifiers>
    <length>100</length>
   </stringQualifiers>
  </type>
 </attributes>
 <attributes>
  <name>DefaultBillOfMaterials</name>
  <type>
   <types>CatalogRef.BillOfMaterials</types>
  </type>
 </attributes>
 <attributes>
  <name>UseIncomingStockReservation</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
 <attributes>
  <name>PackageUnit</name>
  <type>
   <types>CatalogRef.Units</types>
  </type>
 </attributes>
 <tabularSections>
  <name>AddAttributes</name>
  <attributes>
   <name>Property</name>
   <type>
    <types>ChartOfCharacteristicTypesRef.AddAttributeAndProperty</types>
   </type>
  </attributes>
  <attributes>
   <name>Value</name>
   <type>
    <types>Characteristic.AddAttributeAndProperty</types>
   </type>
  </attributes>
  <attributes>
   <name>SearchLiteral</name>
   <type>
    <types>String</types>
    <stringQualifiers>
     <length>500</length>
    </stringQualifiers>
   </type>
  </attributes>
 </tabularSections>
 <tabularSections>
  <name>SpecificationAffectPricingMD5</name>
  <attributes>
   <name>Key</name>
   <type>
    <types>DefinedType.typeRowID</types>
   </type>
  </attributes>
  <attributes>
   <name>AffectPricingMD5</name>
   <type>
    <types>String</types>
    <stringQualifiers>
     <length>100</length>
    </stringQualifiers>
   </type>
  </attributes>
 </tabularSections>
 <tabularSections>
  <name>ConsignorsInfo</name>
  <attributes>
   <name>Company</name>
   <type>
    <types>CatalogRef.Companies</types>
   </type>
  </attributes>
  <attributes>
   <name>Consignor</name>
   <type>
    <types>CatalogRef.Companies</types>
   </type>
  </attributes>
 </tabularSections>
</mdclass:Catalog>

IRP/src/Catalogs/SerialLotNumbers/ManagerModule.bsl
Procedure ChoiceDataGetProcessing(ChoiceData, Parameters, StandardProcessing)
	If TypeOf(Parameters) <> Type("Structure") Or Not ValueIsFilled(Parameters.SearchString)
		Or Not Parameters.Filter.Property("AdditionalParameters") Then
		Return;
	EndIf;

	StandardProcessing = False;

	QueryTable = GetChoiceDataTable(Parameters);
	ChoiceData = New ValueList();
	For Each Row In QueryTable Do
		ChoiceData.Add(Row.Ref, Row.Presentation);
	EndDo;
EndProcedure

Function GetChoiceDataTable(Parameters) Export
	Filter = " AND
			 |	((CAST(Table.SerialLotNumberOwner AS Catalog.ItemTypes)) = &ItemType
			 |		OR (CAST(Table.SerialLotNumberOwner AS Catalog.Items)) = &Item
			 |		OR (CAST(Table.SerialLotNumberOwner AS Catalog.ItemKeys)) = &ItemKey
			 |		OR Table.SerialLotNumberOwner.Ref IS NULL)";

	Settings = New Structure();
	Settings.Insert("MetadataObject", Metadata.Catalogs.SerialLotNumbers);
	Settings.Insert("Filter", Filter);

	QueryBuilderText = CommonFormActionsServer.QuerySearchInputByString(Settings);

	QueryBuilder = New QueryBuilder(QueryBuilderText);
	QueryBuilder.FillSettings();
	If TypeOf(Parameters) = Type("Structure") And Parameters.Filter.Property("CustomSearchFilter") Then
		ArrayOfFilters = CommonFunctionsServer.DeserializeXMLUseXDTO(Parameters.Filter.CustomSearchFilter);
		For Each Filter In ArrayOfFilters Do
			NewFilter = QueryBuilder.Filter.Add("Ref." + Filter.FieldName);
			NewFilter.Use = True;
			NewFilter.ComparisonType = Filter.ComparisonType;
			NewFilter.Value = Filter.Value;
		EndDo;
	EndIf;
	Query = QueryBuilder.GetQuery();

	Query.SetParameter("SearchString", Parameters.SearchString);

	AdditionalParameters = CommonFunctionsServer.DeserializeXMLUseXDTO(Parameters.Filter.AdditionalParameters);
	Query.SetParameter("ItemType", AdditionalParameters.ItemType);
	Query.SetParameter("Item", AdditionalParameters.Item);
	Query.SetParameter("ItemKey", AdditionalParameters.ItemKey);

	Return Query.Execute().Unload();
EndFunction

Function GetStockBalanceDetailByOwner(Owner) Export
	StockBalanceDetail = False;
	If Not ValueIsFilled(Owner) Then
		Return StockBalanceDetail;
	EndIf;
	
	If TypeOf(Owner) = Type("CatalogRef.ItemKeys") Then
		StockBalanceDetail = Owner.Item.ItemType.StockBalanceDetail;
	ElsIf TypeOf(Owner) = Type("CatalogRef.Items") Then
		StockBalanceDetail = Owner.ItemType.StockBalanceDetail;
	ElsIf TypeOf(Owner) = Type("CatalogRef.ItemTypes") Then
		StockBalanceDetail = Owner.StockBalanceDetail;
	EndIf;
	Return StockBalanceDetail;
EndFunction
